Revit 2025 API
ModuleStatus Enumeration
 The Macro module status.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ModuleStatus
Public Enumeration ModuleStatus
public enum class ModuleStatus
type ModuleStatus
Members
Member name | Value | Description
Loaded | 0 |  The module is loaded.
BuildFailed | 1 |  Failed to build the module.
LoadFailed | 2 |  Failed to load the module.
Disabled | 3 |  The module is disabled.
Corrupt | 4 |  The module is corrupt.
NotBuild | 5 |  The module is not build.
See Also
Reference
Autodesk.Revit.DB.Macros Namespace